{
    "projects": [
        {
            "id": 1,
            "name": "My Weather",
            "github_url": "https://github.com/DreRandaci/weather-app",
            "img": "https://user-images.githubusercontent.com/30006986/32286425-68b73db8-befb-11e7-9640-bdbef37cb32c.gif",
            "firebase_url": "",
            "description": "See 1, 3, and 5 day weather forecasts by zipcode using the Open Weather API."
    
        },
        {
            "id": 2,
            "name": "Chat App",
            "github_url": "https://github.com/nss-evening-cohort-06/chatty-fancy-butterflies",
            "img": "https://user-images.githubusercontent.com/30006986/30834406-99eebf50-a218-11e7-8b56-9f3e053ef105.gif",
            "firebase_url": "",
            "Contributors": "Dre Randaci, Gib Bowden, Ken Lewis, Ben Harrington.",
            "description": "Chat app built for sending and editing messages. Users can select a theme profile that changes icons and color layout. Options for text size are included."
    
        }
    ],
    "blogs": [{
        "id": 1,
        "title": "First few weeks in the code zone",
        "content": "So far, this whole coding thing has been pretty great. CSS is definitely something I want to be good at because it will most likely frustrate me more than the other languages (look out, JS). I&#39;ve been getting better at understanding the Chrome dev tools, and that is SUPER helpful, especially for layout and just seeing where tf everything is. We had our first JS lesson last night and I&#39;m pumped to see how I digust actually making programs. Stoked!",
        "date": "07-25-2017"
  
      },
      {
        "id": 2,
        "title": "Javascript: Do you know where YOUR variables are defined?",
        "content": "Javascript is intimidating and mind bending; so much power with such little code! The possibilites are endless with how you use it. I'm not going to pretend like I fully understand it yet, as I struggled with the YDKJS: Tax Rate challenge but nearly came close to getting it correct. Starting to see some progress and less blank staring at my laptop screen (although, this is likely to come back around as class gets denser!).",
        "date": "07-28-2017"
      },
      {
        "id": 3,
        "title": "Javascript, tho",
        "content": "So, we had the 'Coin Counter' exercise this week, which basically helped to kick my arse into high gear for what's to come. As frustrating as JS can be, there is an immense satisfaction in finding solutions. Things I learned during this exercise: 1) If in doubt, start wherever you know. Try things. Try a lot of things. Especially in codewars (holy cow, very challenging, but super helpful). 2) When working with others or in groups, make sure to try and tackle one problem at a time. Things can branch off quickly and get murky. Otherwise, I just need to keep practicing and working on as many different problems as possible.",
        "date": "07-31-2017"
      },
      {
        "id": 4,
        "title": "Tempereture Converter",
        "content": "The 'Tempereture Converter' assigment was tricky. There were a few concepts that were unfamiliar but it all worked out in the end. First time dealing with event handlers and I definitely kept calling the anonymous functions incorrectly.",
        "date": "08-04-2017"
      },
      {
        "id": 5,
        "title": "XHR",
        "content": "XHR was a little weird at first and 'Seasonal Sales' was definitely a little challenging. I struggled the most accessing the objects at the appropriate times and toggling between classes when displaying the different prices on the page. I started writing code one way and refactored it after going over a few concepts in class, which I think played a part in my confusion later on.",
        "date": "08-29-2017"
      },
      {
        "id": 6,
        "title": "Bootstrap",
        "content": "Bootstrap rules. More CSS frameworks please.",
        "date": "09-05-2017"
      },
      {
        "id": 7,
        "title": "Task Runners and Browserify",
        "content": "Browserify is amazing and I never want to go back. Eliminating as many bugs as possible before launching an app makes going through the whole process less volitile.",
        "date": "09-18-2017"
      },
      {
        "id": 8,
        "title": "Chatty App and jQuery",
        "content": "The group project was an incredible learning experience. We had a broken app to present, but the workflow and features we added were fantastic practice in using all the available debugging and development tools.",
        "date": "10-7-2017"
      },
      {
        "id": 9,
        "title": "Promises",
        "content": "Promises are a big improvement over XHR requests. Very straightforward, although a bit tricky to debug.",
        "date": "10-17-2017"
      },
      {
        "id": 10,
        "title": "API's",
        "content": "API's are a test in your abilities to actually understand documentation.",
        "date": "10-24-2017"
      },
      {
        "id": 11,
        "title": "Firebase",
        "content": "Firebase is cool. It's nice being able to actually deploy an application and share it with others.",
        "date": "10-31-2017"
      },
      {
        "id": 12,
        "title": "Theme Park Group Proj",
        "content": "This was a monster of a project. We had some real struggles in structuring our data correctly. Being more proficient with promises would've helped exponentially.",
        "date": "11-11-2017"
      },
      {
        "id": 13,
        "title": "AngularJS",
        "content": "The days of domStrings are long gone. I was getting to the point where I would try using anything other than a forEach loop to write HTML in JavaScript, but thanks to Angular that problem is dust in the wind.",
        "date": "11-22-2017"
      }
    ]
  }